sedfoam-master/tutorials/RAS/2DScour/0_org/k.b
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-12; 

boundaryField
{
    inandouthalf11
    {
	type		fixedValue;
	value 		uniform 1e-4;
    }
    inandouthalf12
    {
        type            zeroGradient;
    }
    inandouthalf21
    {
        //type            zeroGradient;
	type		fixedValue;
	value		uniform 1.e-12;
    }
    inandouthalf22
    {
//        type            cyclic;
        type            fixedValue;
        value           uniform 1.e-12;
    }
    top
    {
//        type            symmetryPlane;
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
