sedfoam-master/tutorials/RAS/2DScour/0_org/p_rbgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inandouthalf11
    {
        type            zeroGradient;
    }
    inandouthalf12
    {
       type            fixedValue;
       value           uniform  0;
    }
    inandouthalf21
    {
        type            fixedFluxPressure;
        gradient           $internalField;
        value           uniform 2262.02;
    }
    inandouthalf22
    {
        type            fixedFluxPressure;
        gradient           $internalField;
        value           uniform 2262.02;
    }
    top
    {
	type		zeroGradient;
//	type		fixedValue;
//	value		uniform 0;
//        type            symmetryPlane;
//        type            groovyBC;
//        value           uniform  0;
//        valueExpression "9.0774*(1.1-pos().x)";
    }
    walls
    {
        type            fixedFluxPressure;
        gradient           $internalField;    
        value           uniform 2262.02;
    	//type            zeroGradient;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
